Vroobee/Vroobee_public/MW_DEV_BOARD_STM32F103CBT6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC1_RES_Pin GPIO_PIN_0
#define ADC1_RES_GPIO_Port GPIOA
#define ADC2_RES_Pin GPIO_PIN_1
#define ADC2_RES_GPIO_Port GPIOA
#define ADC1_12V_Pin GPIO_PIN_2
#define ADC1_12V_GPIO_Port GPIOA
#define ADC2_12V_Pin GPIO_PIN_3
#define ADC2_12V_GPIO_Port GPIOA
#define ADC1_3V3_Pin GPIO_PIN_4
#define ADC1_3V3_GPIO_Port GPIOA
#define ADC2_3V3_Pin GPIO_PIN_5
#define ADC2_3V3_GPIO_Port GPIOA
#define ADC3_3V3_Pin GPIO_PIN_6
#define ADC3_3V3_GPIO_Port GPIOA
#define ADC4_3V3_Pin GPIO_PIN_7
#define ADC4_3V3_GPIO_Port GPIOA
#define USER_LED_Pin GPIO_PIN_0
#define USER_LED_GPIO_Port GPIOB
#define USER_SW_Pin GPIO_PIN_1
#define USER_SW_GPIO_Port GPIOB
#define USER_SW_EXTI_IRQn EXTI1_IRQn
#define SD_CS_Pin GPIO_PIN_12
#define SD_CS_GPIO_Port GPIOB
#define D_IN1_Pin GPIO_PIN_4
#define D_IN1_GPIO_Port GPIOB
#define D_IN1_EXTI_IRQn EXTI4_IRQn
#define D_IN2_Pin GPIO_PIN_5
#define D_IN2_GPIO_Port GPIOB
#define D_IN2_EXTI_IRQn EXTI9_5_IRQn
#define D_IN3_Pin GPIO_PIN_6
#define D_IN3_GPIO_Port GPIOB
#define D_IN3_EXTI_IRQn EXTI9_5_IRQn
#define D_IN4_Pin GPIO_PIN_7
#define D_IN4_GPIO_Port GPIOB
#define D_IN4_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
